# -*- coding: utf-8 -*-
# @Time    : 2024/4/10 下午9:31
# @Author  : 顾安
# @File    : 3.while循环嵌套.py
# @Software: PyCharm


# i = 0
# while i < 3:
#     print("安娜老师: 双双咱们去淦饭～")
#     print("双双老师: 好呀好呀～")
#     print("安娜老师: 那吃什么呢？")
#     print("双双老师: 猪蹄YYDS！")
#     print("安娜老师: 小心胖三斤...")
#     print("安娜老师: 哈哈~")
#     print("安娜老师: 哈哈~")
#     print("安娜老师: 哈哈~")
#     print('')
#
#     i += 1

i = 1
y = 1

while i <= 3:
    print("安娜老师: 双双咱们去淦饭～")
    print("双双老师: 好呀好呀～")
    print("安娜老师: 那吃什么呢？")
    print("双双老师: 猪蹄YYDS！")
    print("安娜老师: 小心胖三斤...")
    while y <= i:
        print("安娜老师: 哈哈~")
        print('-' * 30)
        y += 1
    i += 1


"""
1.如果循环结构中有内层循环并且内层循环执行过一次后, 重新循环的起始位置在内层循环的开头
2.如果内层循环中的条件不成立则不会影响外层循环[整个程序不会退出循环而是执行外层循环的代码]
"""
